// 5. Вивести кожен елемент масиву, сусід справа якого є парним
// EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56

// let arr = [1, 2, 3, 5, 7, 9, 56, 8, 67];
//
// for (let i = 0; i < arr.length; i++) {
//     if (arr[i+1] % 2 === 0) {
//         console.log(arr[i]);
//     }
// }


// 6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.

// let arr = [100,250,50,168,120,345,188];
// let sum = 0;
//
// for (i = 0; i < arr.length; i++) {
//     sum += arr[i]/arr.length;
// }
// console.log(sum);


//7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.

// let arr = [1, 2, 3, 5, 7, 9, 56, 8, 67];
// let emptyArr = [];
//
// for (let i = 0; i < arr.length; i++) {
//     emptyArr.push(arr[i] * 5);
// }
// console.log(emptyArr);


// 8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив.

// let arr = [1, 2, true, 3, 'hello', 5, true, 'okten', 7, 9, false, 'world', 56, null, 8, 67];
// let arrNew = [];
//
// for (let i = 0; i < arr.length; i++) {
//     if (typeof arr[i] === "number") {
//         arrNew.push(arr[i])
//     }
// }
// console.log(arrNew);



//BONUS

//- Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.

// let arr = ['a','b','c'];
