// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу. ???????????
//
// let arr = ['a', 'b', 'c']; // так можна?
//
// for (let i = 0; i < 3; i++) {
//     arr.push(i + 1);
// }
// console.log(arr);
//
// let arr = ['a', 'b', 'c'];
//
// for (let i = 1; i < 4; i ++){
//     arr.push(i);
// }
// console.log(arr);
//
// це норм, що воно мені на "і" свариться?
//
// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
//
// let arr1 = [1, 2, 3];
// let arrNew = [];
// for (let i = arr1.length - 1; i >= 0; i--) {
//     arrNew.push(arr1[i]);
// }
// console.log(arrNew);
//
//
// // варіант 2
//
// let arr1 = [1, 2, 3];
// let arrNew = [];
// for (let i = 0; i < arr1.length; i++) {
//     arrNew.unshift(arr1[i]);
// }
// console.log(arrNew);
//
//
// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
//
// let arr2 = [1, 2, 3];
// arr2.push(4, 5, 6);
// console.log(arr2);
//
//
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
//
// let arr3 = [1, 2, 3];
// arr3.unshift(4,5,6);
// console.log(arr3);
//
//
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
//
// let arr4 = ['js', 'css', 'jq'];
//
//
// let arr4 = ['js', 'css', 'jq'];
// let arrElement = arr4.shift();
// console.log(arrElement);
//
//
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
//
// let arr5 = ['js', 'css', 'jq'];
// let arrElement = arr5.pop();
// console.log(arrElement);
//
//
// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [4, 5].
//
// let arr6 = [1, 2, 3, 4, 5];
//
// for (let i = 0; i < 3; i++) {
//     arr6.shift();
// }
// console.log(arr6);
//
// let arr6 = [1, 2, 3, 4, 5];
// arr6.splice(0,3);
// console.log(arr6);
//
//
// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [1,2].
//
// let arr7 = [1, 2, 3, 4, 5];
// for (let i = 0; i < 3; i++) {
//     arr7.pop();
// }
// console.log(arr7);
//
// let arr7 = [1, 2, 3, 4, 5];
// arr7.splice(2,3);
// console.log(arr7);
//
//
// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
//
// let arr8 = [1, 2, 3, 4, 5];
//
// for (let i = 0; i < 3; i++) {
//     arr8.shift();
// }
// arr8.unshift(1, 2, 3, 'a', 'b', 'c');
// console.log(arr8);
//
//
// let arr8 = [1, 2, 3, 4, 5];
// arr8.splice(3, 0,  'a', 'b', 'c');
// console.log(arr8);
//
//
// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
//
// let arr9 = [1, 2, 3, 4, 5];
// arr9.shift();
// arr9.pop();
// arr9.unshift(1, 'a', 'b');
// arr9.push('c', 5, 'e');
//
// console.log(arr9);
//
//
// let arr9 = [1, 2, 3, 4, 5];
// arr9.splice(1,0,  'a', 'b');
// arr9.splice(-1,1,  'c', 5, 'e');
// console.log(arr9);
//
// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
//
// let arr10 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
//
// for (i = 0; i < arr10.length; i++) {
//     if (arr10[i] % 2 === 0) {
//         console.log(arr10[i]);
//     }
// }
//
//
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
//
// let arr11 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// let arr11New = [];
//
// for (let i = 0; i < arr11.length; i++) {
//     arr11New.push(arr11[i])
// }
// console.log(arr11New);
//
//
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
//
// let arr12 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// let arr12New = [];
//
// for (i = 0; i < arr12.length; i++){
//     arr12New[i] = arr12[i];
// }
// console.log(arr12New);
//
//
// _______________________________________________________________________________________________________________________
//
//
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//
// 1. перебрати його циклом while
//
// let arr13 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// let i = 0;
// while (i < arr13.length) {
//     console.log(arr13[i]);
//     i++;
// }
//
//
// 2. перебрати його циклом for
//
// let arr13 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// for (i=0; i <arr13.length; i++) {
//     console.log(arr13[i]);
// }
//
//
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
//
// let arr13 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// let i = 0;
// while (i < arr13.length) {
//     if (i % 2 === 0) {
//         console.log(arr13[i]);
//     }
//     i++;
// }
//
//
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
//
// let arr13 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// for (i = 0; i < arr13.length; i++) {
//     if (i % 2 === 0) {
//         console.log(arr13[i]);
//     }
// }
//
//
// 5. перебрати циклом while та вивести  числа тільки парні  значення
//
// let arr13 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// let i = 0;
// while (i < arr13.length) {
//     if (arr13[i] % 2 === 0) {
//         console.log(arr13[i]);
//     }
//     i++;
// }
//
//
// 6. перебрати циклом for та вивести  числа тільки парні  значення
//
// let arr13 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// for (i = 0; i < arr13.length; i++) {
//     if (arr13[i] % 2 === 0) {
//         console.log(arr13[i]);
//     }
// }
//
//
// 7. замінити кожне число кратне 3 на слово "okten"
//
// let arr13 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// for (i = 0; i < arr13.length; i++) {
//     if (arr13[i] % 3 === 0) {
//         arr13[i] = 'okten';
//     }
//     console.log(arr13[i]);
// }
//
//
// 8. вивести масив в зворотньому порядку.
//
// let arr13 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// for (let i = arr13.length - 1; i >= 0; i--) {
//     console.log(arr13[i]);
// }
//
//
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//
// 1. перебрати його циклом while
//
// let arr13 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// //
// // let i = arr13.length-1;
// // while (i >=0) {
// //     console.log(arr13[i]);
// //     i--;
// // }
//
//
// 2. перебрати його циклом for
//
// let arr13 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// for (let i = arr13.length - 1; i >= 0; i--) {
//     console.log(arr13[i]);
// }
//
//
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
//
// let arr13 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// let i = arr13.length - 1;
// while (i >= 0) {
//     if (i % 2 === 0) {
//         console.log(arr13[i]);
//     }
//     i--;
// }
//
//
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
//
// let arr13 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// for (i = arr13.length - 1; i >= 0; i--) {
//     if (i % 2 === 0) {
//         console.log(arr13[i]);
//     }
// }
//
//
// 5. перебрати циклом while та вивести  числа тільки парні  значення
//
// let arr13 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// let i = arr13.length-1;
// while (i >=0) {
//     if (arr13[i] % 2 === 0) {
//         console.log(arr13[i]);
//     }
//     i--;
// }
//
//
// 6. перебрати циклом for та вивести  числа тільки парні  значення
//
// let arr13 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// for (i = arr13.length - 1; i >= 0; i--) {
//     if (arr13[i] % 2 === 0) {
//         console.log(arr13[i]);
//     }
// }
//
//
// 7. замінити кожне число кратне 3 на слово "okten"
//
// let arr13 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// for (i = arr13.length - 1; i >= 0; i--) {
//     if (arr13[i] % 3 === 0) arr13[i] = 'okten'; {
//         console.log(arr13[i]);
//     }
// }
//
//
// 10
//  створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.
//
// let arrEmpty = [];
//
// for (i = 0; i < 100; i++) {
//     if (i % 2 === 0) {
//         arrEmpty.push(i);
//     }
// }
// console.log(arrEmpty);
//
// let arrEmpty2 = [];
//
// for (i = 0; i < 100; i++) {
//     if (i % 2 === 1) {
//         arrEmpty2.push(i);
//     }
// }
// console.log(arrEmpty2);
//
//
// ________________________________________________________________________________________________________________________
//
// 1. Створити пустий масив та :
//     a. заповнити його 50 парними числами за допомоги циклу. --> завдання 10
//     b. заповнити його 50 непарними числами за допомоги циклу. --> завдання 10
//     c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)
//
// let arrEmpty3 = [];
//
// for (i=0; i < 20; i++) {
//     arrEmpty3.push(parseInt(Math.random()*100));
// }
// console.log(arrEmpty3);
//
//
// d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)
//
// let arrEmpty4 = [];
//
// for (i = 0; i < 20; i++) {
//     arrEmpty4.push(parseInt(Math.random() * (732 - 8) +8));
// }
// console.log(arrEmpty4);
//
//
// 2. Вивести за допомогою console.log кожен третій елемен
//
// let arrEmpty3 = [];
//
// for (i=0; i < 20; i++) {
//     arrEmpty3.push(parseInt(Math.random()*100));
// } for (let i = 0; i < 20; i += 3) {
//     console.log(arrEmpty3[i]);
// }
//
//
// 3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
//
// let arrEmpty3 = [];
//
// for (i = 0; i < 20; i++) {
//     arrEmpty3.push(parseInt(Math.random() * 100));
// } for (let i = 0; i < 20; i += 3) {
//     if (arrEmpty3[i] % 2 === 0) {
//         console.log(arrEmpty3[i])
//     }
// }
//
//
// 4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
//
// let arr5 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20];
// let arr5New = [];
//
// for (let  i = 0; i < arr5.length; i += 3) {
//     if (arr5[i] % 2 === 0) {
//         arr5New.push(arr5[i]);
//     }
// }
// console.log(arr5New);

//
//
//
